In [ ]:
pip install pymongo

In [1]:
import  numpy as np
import matplotlib.pyplot as plt
import pymongo

In [2]:
from pymongo import MongoClient

In [3]:
import json

In [4]:
import warnings
warnings.filterwarnings('ignore')

In [5]:
Client = MongoClient('localhost',27017)

In [6]:
Client.list_database_names()

['admin', 'config', 'gotham', 'local']

In [7]:
print(Client.list_database_names())

['admin', 'config', 'gotham', 'local']

In [8]:
db=Client.gotham

In [10]:
collect_names = db.list_collection_names()

In [11]:
collect_names

['biodata', 'customer']

In [12]:
coll=list(db.biodata.find())

In [13]:
coll

[{'_id': 1.0, 'name': 'ankur', 'class': 10.0, 'age': 21.0},
 {'_id': 4.0, 'name': 'maruf', 'class': 10.0, 'age': 20.0},
 {'_id': 2.0, 'name': 'gotham', 'class': 10.0},
 {'_id': 5.0, 'name': 'sami', 'age': 22.0, 'class': 9.0},
 {'_id': 6.0, 'name': 'tia', 'age': 24.0, 'class': 9.0},
 {'_id': 7.0, 'name ': None, 'age': 25.0, 'class': 12.0, 'name': 'ramu'},
 {'_id': 8.0, 'name': 'reyt', 'age': 19.0, 'class': 8.0}]

In [14]:
import pandas as pd

In [18]:
df =pd.DataFrame(coll)

In [19]:
df

   _id   age  class    name  name
0  1.0  21.0   10.0   ankur    NaN
1  4.0  20.0   10.0   maruf    NaN
2  2.0   NaN   10.0  gotham    NaN
3  5.0  22.0    9.0    sami    NaN
4  6.0  24.0    9.0     tia    NaN
5  7.0  25.0   12.0    ramu    NaN
6  8.0  19.0    8.0    reyt    NaN

In [20]:
df.mean()

_id       4.714286
age      21.833333
class     9.714286
name           NaN
dtype: float64

In [23]:
custo=list(db.customer.find())

In [25]:
custo

[{'_id': 1.0, 'name': 'ria', 'age': 12.0, 'phn': 351067.0},
 {'_id': 2.0, 'name': 'tia', 'age': 17.0, 'phn': 351068.0},
 {'_id': 3.0, 'name': 'gia', 'age': 18.0, 'phn': 351132.0},
 {'_id': 4.0, 'name': 'eawa', 'age': 18.0, 'phn': 2809061.0},
 {'_id': 5.0, 'name': 'rawa', 'age': 18.0, 'phn': 351133.0},
 {'_id': 6.0, 'name': 'ral', 'age': 22.0, 'phn': 2809071.0},
 {'_id': 7.0, 'name': 'tal', 'age': 21.0, 'phn': 351151.0},
 {'_id': 8.0, 'name': 'tadl', 'age': 24.0, 'phn': 2809214.0},
 {'_id': 9.0, 'name': 'nia', 'age': 25.0, 'phn': 22473716.0},
 {'_id': 10.0, 'name': 'nia', 'age': 25.0, 'phn': 179789734.0}]

In [26]:
df1=pd.DataFrame(custo)

In [27]:
df1

    _id   age  name          phn
0   1.0  12.0   ria     351067.0
1   2.0  17.0   tia     351068.0
2   3.0  18.0   gia     351132.0
3   4.0  18.0  eawa    2809061.0
4   5.0  18.0  rawa     351133.0
5   6.0  22.0   ral    2809071.0
6   7.0  21.0   tal     351151.0
7   8.0  24.0  tadl    2809214.0
8   9.0  25.0   nia   22473716.0
9  10.0  25.0   nia  179789734.0

In [36]:
df1.age>18

0    False
1    False
2    False
3    False
4    False
5    False
6    False
7    False
8    False
9    False
Name: age, dtype: bool

In [17]:
df2=pd.DataFrame(coll)

In [18]:
df2

   _id   age  class    name  name
0  1.0  21.0   10.0   ankur    NaN
1  4.0  20.0   10.0   maruf    NaN
2  2.0   NaN   10.0  gotham    NaN
3  5.0  22.0    9.0    sami    NaN
4  6.0  24.0    9.0     tia    NaN
5  7.0  25.0   12.0    ramu    NaN
6  8.0  19.0    8.0    reyt    NaN

In [22]:
df2._id>10

0    False
1    False
2    False
3    False
4    False
5    False
6    False
Name: _id, dtype: bool